This document is a (relatively) short description of using Dart as one of the languages in Emacs org-mode Babel.

* A Simple Example of running Dart code in Emacs org-mode (Babel source blocks)

A Extremely simple usage example:

After installation (see the Installation section):

- In this README.org file, viewed in emacs
- Put cursor anywhere inside the ~#+begin_src ... #+end_src~ block below (this block is hidden if you are reading this on Github)
- Hit C-c C-c (holding down the Ctrl button, hit c twice). Thi will run the code snippet in Dart, and show result below in the ~#+results~ section.

#+BEGIN_SRC dart :exports both
return [1,2, 11,13].reduce(max);
#+END_SRC

#+RESULTS:
: 13

There are more examples in the Examples section.


*** Chapter 2: Dart Sample Code

The following code prints true and false.

#+BEGIN_SRC dart :exports both :results output
def str = "hello" + " there";
print (str == "hello there");
print (str == "not hello there");
#+END_SRC

#+RESULTS:
: true
: false

Entering C-c C-c (Control down, enter the  c key twice) with cursor between ~#+begin_src and #+end_src~ will produce the results section. Chang code and repeat.


*** Chapter 3: Conditionals

#+BEGIN_SRC dart :exports both :results output
var status = 'Ok';
if (status) {
  print ('Status was true');
} else {
  print('Status was false');
}
#+END_SRC

#+RESULTS:
: Status was false

This shows we run in production mode; not in checked mode.


* Example 2: Show Differences between :results value and :results output and :results output(or value) raw

Examples show the rather boring differences between various collection types (:results output/value with potential format raw). See http://orgmode.org/manual/results.html

#+BEGIN_SRC dart :exports both :results value
  var listMax = [1,2,3].reduce(max);
  print  ("In output mode, all printed lines show in result");
  print  ("List max printed = " + listMax.toString());
  return  "List max returned = " + listMax.toString(); // Note: bug in Org export (C-c C-e h o) prevents a syntactically correct:   return  "List max returned = ${listMax}"; 
#+END_SRC

#+RESULTS:
: List max returned = 3


#+BEGIN_SRC dart :exports both :results value table
  var listMax = [1,2,3].reduce(max);
  print  ("In output mode, all printed lines show in result");
  print  ("List max printed = " + listMax.toString());
  return  "List max returned = " + listMax.toString();
#+END_SRC

#+RESULTS:
| List max returned = 3 |

To output an actual table, return a list. Like this:

#+BEGIN_SRC dart :exports both :results value table 
  return [1,2];
#+END_SRC

#+RESULTS:
| 1 | 2 |

Or if you want to return a table with headers, like this:

#+BEGIN_SRC dart :exports both :results value table 
  return [ 
    ["col_1", "col_2"], // no spaces in headers; default impl breaks on them
    [1,       2],
    [3,       4]
  ];
#+END_SRC

#+RESULTS:
| col_1 | col_2 |
|     1 |     2 |
|     3 |     4 |


#+BEGIN_SRC dart :exports both :results output
  var listMax = [1,2,3].reduce(max);
  print  ("In output mode, all printed lines show in result");
  print  ("List max printed = " + listMax.toString());
  return  "List max returned = " + listMax.toString();
#+END_SRC

#+RESULTS:
: In output mode, all printed lines show in result
: List max printed = 3


Table is correctly ignored with output, showing quoted results, as shown below:

#+BEGIN_SRC dart :exports both :results output table 
  var listMax = [1,2,3].reduce(max);
  print  ("In output mode, all printed lines show in result");
  print  ("List max printed = " + listMax.toString());
  return  "List max returned = " + listMax.toString();
#+END_SRC

#+RESULTS:
: In output mode, all printed lines show in result
: List max printed = 3

Raw does not add any formatting to the result in neither "output", nor "value" mode, and results appear as regular text, as shown below. Also note that because org mode joins lines of regular text, multiple printed lines of results are joined.

#+BEGIN_SRC dart :exports both :results value raw
  var listMax = [1,2,3].reduce(max);
  print  ("In output mode, all printed lines show in result");
  print  ("List max printed = " + listMax.toString());
  return  "List max returned = " + listMax.toString();
 #+END_SRC



#+BEGIN_SRC dart :exports both :results output raw
  var listMax = [1,2,3].reduce(max);
  print  ("In output mode, all printed lines show in result");
  print  ("List max printed = " + listMax.toString());
  return  "List max returned = " + listMax.toString();
#+END_SRC


* Resolving Current Limitations

Below, a discussion for each numbered item in the Limitations section.

1. :var not passed to Dart. Should deal with this first, for Dart code blocks to play nice in org context, and accept, rather than just return, information.

2. Code that will work (and not work) inside the ~#+begin_src and #end_src~.

   - Issues with solving this limitation: I want to add support for "any" Dart code soon, so functions, classes, and methods can be defined, then used in Org Babel Dart. Ideally, any valid Dart code that would run from the Dart command line can be pasted in the Org code sections and support the basic results modes. But this would make it impossible to support the :results value, because the Dart ~main()~ function does not return a value. Currently, ob-dart works around the :results value problem by wrapping the code and a combination pf running Zoned to ignore print(), and relying on return present in the org code, wraping it as print(). But to solve this in a general case,  would require a deeper level of code manipulation either with emacs Semantic or Dart Analyser (https://github.com/dart-lang/sdk/tree/master/pkg/analyzer) (to wrap a return as print or similar).

   - Suggested solutions: I think for now I arrived at supporting the following "Styles" - When Org Babel Dart code uses any of the styles below, it will work without adding further org mode special flags, headers, or markers.

     - *Dart Style Top Level Functional*: This is the currently supported style.The  ~#+begin_src and #end_src~ section can contain any code that can be inside a top-level Dart function without any class context from "above" the top level method. Some basic imports are added before the conde runs. Both ":results value" and ":results output" do work as expected. 

       - Valid examples (this works becaue functions can be nested, so this works wrapped in main):

         #+BEGIN_SRC dart :exports both :results value
         square(x) {
           return x * x;
         }
         return square(2);
         #+END_SRC

         #+RESULTS:
         : 4

         #+BEGIN_SRC dart :exports both :results value
         var x = 1.5;
         var y = 2;
         return max(pow(x, 4), pow(y, 2));
         #+END_SRC

         #+RESULTS:
         : 5.0625

       - Invalid Example (does not work because class cannot be nested in a function, and we are wrapping all code in main())

         #+BEGIN_SRC dart :exports both :results value
           /* nesting class in a top-level function fails
           class C {
             square(x) {
               return x * x;
             }
           }
           var c = new C();
           return c.square(2);
           */ 
         #+END_SRC

         #+RESULTS:
         : null

     - *Dart Style Aided Functional*: This will be extension of the mode above. It will allow to define classes above code, and use them in code. It will require user to enter a special marker in code; code above the marker will be evaluated on top level, and so classes and functions defined above the marker can be used below it. This will make the example from above valid. Both ":results value" and ":results output" will work as expected. 

       - Valid Example (does work because we split code on the marker, and only wrap the code below the "separator" string)

         #+BEGIN_SRC dart :results value
           /* todo - uncomment once support added
           class C {
             square(x) {
               return x * x;
             }
           }
           // Org-Dart-Functional
           var c = new C();
           return c.square(2);
           */
         #+END_SRC

         #+RESULTS:
         : null

       - todo: provide an invalid example

     - *Dart Style Dart Program*: This will be different from either styles above. Any fully valid Dart program can be entered; it must include the main() method. Only  ":results output" will be a valid option, ":results value" will cause an error..

       - Valid Example:

         #+BEGIN_SRC dart :exports both :results value
           /* todo - uncomment once support added
           class C {
             square(x) {
               return x * x;
             }
           }
           main() {
             var c = new C();
             print( c.square(2) );
           }
           */ 
         #+END_SRC

         #+RESULTS:
         : null


